Revit 2027 API
LoadCombinationType Enumeration
 Specifies load combination type.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum LoadCombinationType
Public Enumeration LoadCombinationType
public enum class LoadCombinationType
type LoadCombinationType
Members
Member name | Value | Description
Combination | 0 |  Combination
Envelope | 1 |  Envelope
See Also
Reference
Autodesk.Revit.DB.Structure Namespace